import './App.css'

// - App კომპონენტი, რომელიც მოთავსებულია შესაბამისი დასახელების ფაილში (App.jsx)
// - ფუნქცია App-მა უნდა დააბრუნოს ერთი ელემენტი
// - ამ შემთხვევაში ეს არის ფრაგმენტი (<>), რომელიც არ არის ხილვადი ბრაუზერში
// - რადგან jsx ფაილში დაიმპორტებულია App.css ფაილი, მასში განსაზღვრული სტილიც
// იმოქმედებს დაბრუნებულ სტრუქტურაზე

function App() {

  return (
    <>
      {/* ფიგურულ ფრჩხილებში იხსნება JS გარემო, ასე იწერება კომენტარი */}
      {/* inline სტილის ჩასმა jsx-ში ხდება თავისებურად, ობიექტის სახით */}
      {/* სტილის property-ები წარმოდგენილია camelCase ფორმით */}
      <h1 style={{color: "white", backgroundColor: "black", textAlign: "center"}}>
        Hello World
      </h1>
      {/*  
          br თეგი არის void, სტანდარტული html-ისგან განსხვავებით
          jsx-ში ასეთი void თეგები ყოველთვის უნდა დაიხუროს "/" სიმბოლოთი
      */}
      <br/>
      <h2>That's my first webpage made with React</h2>
    </>
  )
}

export default App
